### Métodos y Atributos

In [ ]:
.method() # parentesis al final
.attribute # palabras únicas

In [1]:
# Method es una función puedes o no poner un parámetro
# Attribute encuentran un valor y te lo dan

#### Atributos de un dataframe

In [4]:
import pandas as pd

In [5]:
empresas= {'Empresas':['Empresa A','Empresa B','Empresa C','Empresa D'],
            'Ventas':[1500000,2000000,1234000,100000],
            'Costos':[600000,543678,235453,21464],
            'Ciudad':['Buenos Aires','Los Angeles','México','Miami'],
            'Piezas':[500,1234,6542,2344]}

In [6]:
df=pd.DataFrame(empresas)
df

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires     500
1  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
3  Empresa D   100000   21464         Miami    2344

In [7]:
df.shape

(4, 5)

In [9]:
df.dtypes

Empresas    object
Ventas       int64
Costos       int64
Ciudad      object
Piezas       int64
dtype: object

#### Method de un dataframe

In [10]:
df.head()

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires     500
1  Empresa B  2000000  543678   Los Angeles    1234
2  Empresa C  1234000  235453        México    6542
3  Empresa D   100000   21464         Miami    2344

In [11]:
df.sample(2)

    Empresas   Ventas  Costos        Ciudad  Piezas
0  Empresa A  1500000  600000  Buenos Aires     500
2  Empresa C  1234000  235453        México    6542

In [12]:
df.tail(3)

    Empresas   Ventas  Costos       Ciudad  Piezas
1  Empresa B  2000000  543678  Los Angeles    1234
2  Empresa C  1234000  235453       México    6542
3  Empresa D   100000   21464        Miami    2344

#### Métodos estadísticos

In [18]:
df.describe(include='all')

         Empresas        Ventas         Costos       Ciudad       Piezas
count           4  4.000000e+00       4.000000            4     4.000000
unique          4           NaN            NaN            4          NaN
top     Empresa D           NaN            NaN  Los Angeles          NaN
freq            1           NaN            NaN            1          NaN
mean          NaN  1.208500e+06  350148.750000          NaN  2655.000000
std           NaN  8.043355e+05  271457.791491          NaN  2699.923209
min           NaN  1.000000e+05   21464.000000          NaN   500.000000
25%           NaN  9.505000e+05  181955.750000          NaN  1050.500000
50%           NaN  1.367000e+06  389565.500000          NaN  1789.000000
75%           NaN  1.625000e+06  557758.500000          NaN  3393.500000
max           NaN  2.000000e+06  600000.000000          NaN  6542.000000

In [19]:
df.mean()

Ventas    1208500.00
Costos     350148.75
Piezas       2655.00
dtype: float64

In [20]:
df.count()

Empresas    4
Ventas      4
Costos      4
Ciudad      4
Piezas      4
dtype: int64

In [21]:
df.sum()

Empresas    Empresa AEmpresa BEmpresa CEmpresa D
Ventas                                   4834000
Costos                                   1400595
Ciudad        Buenos AiresLos AngelesMéxicoMiami
Piezas                                     10620
dtype: object

In [22]:
df.std()

Ventas    804335.543580
Costos    271457.791491
Piezas      2699.923209
dtype: float64

In [23]:
df.corr()

          Ventas    Costos    Piezas
Ventas  1.000000  0.896803 -0.200929
Costos  0.896803  1.000000 -0.526225
Piezas -0.200929 -0.526225  1.000000

In [26]:
df.max()

Empresas    Empresa D
Ventas        2000000
Costos         600000
Ciudad         México
Piezas           6542
dtype: object

In [27]:
df.min()

Empresas       Empresa A
Ventas            100000
Costos             21464
Ciudad      Buenos Aires
Piezas               500
dtype: object

In [28]:
df.median()

Ventas    1367000.0
Costos     389565.5
Piezas       1789.0
dtype: float64

In [32]:
df['Ventas'].pct_change(1)

0         NaN
1    0.333333
2   -0.383000
3   -0.918963
Name: Ventas, dtype: float64